app/controllers/categories_controller.rb

SELECT * FROM "subcategories" WHERE ("subcategories".category_id = 1)
---
  def index
    @categories = Category.find(:all)
    @subcategories = Subcategory.find(:all)

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "photo_file_size", "photo_file_name", "photo_content_type", "photo_updated_at") VALUES('Японские подгузники и трусики', 18611, 'японские подгузники и трусики.gif', 'image/gif', '2012-01-24 15:29:14')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
UPDATE "categories" SET "photo_file_size" = 11079, "photo_updated_at" = '2012-01-24 15:40:22' WHERE "id" = 4
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT * FROM "categories" WHERE ("categories"."id" = 8)
DELETE FROM "categories" WHERE "id" = 8
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy