app/controllers/orders_controller.rb

  def index
    @orders = Order.find(:all, :conditions=>{:archive => 0})
---
SELECT * FROM "orders" WHERE ("orders"."archive" = 0)

  def archive
    @orders = Order.find(:all, :conditions=>{:archive => 1})
---
SELECT * FROM "orders" WHERE ("orders"."archive" = 1)