app/controllers/products_controller.rb

  def index
    @products = Product.find(:all)
---
SELECT * FROM "products" WHERE ("products".category_id = 7)

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def edit
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products".category_id = 7)

  def create
    @product = Product.new(params[:product])
    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "category_id", "photo_updated_at", "description", "subcategory_id") VALUES('fgh', 0.0, '2012-01-28 05:29:51', 19623, '2012-01-28 05:29:51', 'img1035_40805.jpg', 'image/jpeg', 1, '2012-01-28 05:29:51', 'fghdfghfdg', 1)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2012-01-29 06:51:45', "category_id" = 7 WHERE "id" = 1

  def subcategory_list
    @category = Category.find(params[:category_id])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 0)