app/controllers/shop_controller.rb

SELECT * FROM "products" ORDER BY created_at DESC LIMIT 20 OFFSET 0
---
  def index
    @products = Product.paginate :page => params[:page], :order => 'created_at DESC'

SELECT * FROM "categories" WHERE ("categories"."id" = '1') LIMIT 1
---
def products_by_category
  @category = Category.find_by_id(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = '3') LIMIT 1
SELECT * FROM "subcategories" WHERE ("subcategories"."id" = '3') LIMIT 1
SELECT * FROM "products" WHERE ("products"."subcategory_id" = '1') ORDER BY created_at DESC LIMIT 20 OFFSET 0
---
def products_by_subcategory
  @category=Subcategory.find_by_id(params[:id]).category
  @products = Product.paginate :page => params[:page], :conditions=>{:subcategory_id => params[:id]}, :order => 'created_at DESC'

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def add_to_cart
    begin
      product = Product.find(params[:id])