app/controllers/shop_controller.rb

def products_by_category
  @category = Category.find_by_id(params[:id])
  @products = Product.paginate :page => params[:page], :conditions=>{:category_id => params[:id]}, :order => 'created_at DESC'
---
SELECT * FROM "products" WHERE ("products"."category_id" = '1') ORDER BY created_at DESC LIMIT 20 OFFSET 0