app/controllers/subcategories_controller.rb

SELECT * FROM "subcategories" WHERE ("subcategories".category_id = 1)
---
  def edit
    @subcategory = Subcategory.find(params[:id])

INSERT INTO "subcategories" ("name", "photo_file_size", "photo_file_name", "photo_content_type", "category_id", "photo_updated_at") VALUES('Подгузники Moony (Муни) ', NULL, NULL, NULL, 1, NULL)
---
  def create
    @subcategory = Subcategory.new(params[:subcategory])

    respond_to do |format|
      if @subcategory.save

SELECT * FROM "subcategories" WHERE ("subcategories"."id" = 3)
UPDATE "subcategories" SET "photo_file_name" = 'Игрушки Plan Toys (Таиланд).jpg', "photo_file_size" = 145964, "photo_updated_at" = '2012-01-26 16:48:47', "photo_content_type" = 'image/jpeg' WHERE "id" = 3
---
  def update
    @subcategory = Subcategory.find(params[:id])

    respond_to do |format|
      if @subcategory.update_attributes(params[:subcategory])