app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "role_id", "remember_token", "login", "email") VALUES('2db7455d15af5709702fea42d0a2c010c95922b4', '2012-01-21 15:07:48', NULL, 'f4e2837e349a5db59bd4937f79d553ece2ecea39', NULL, '2012-01-21 15:07:48', '995b4e38f11ca16235931444eeea7425ec373437', 2, NULL, 'snay', 'snayp@ail.ru')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save